app/views/rooms/index.html.erb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."sender_id" = $1 AND "rooms"."sender_id" = $2 AND "rooms"."receiver_id" = $3 LIMIT $4  [["sender_id", 1], ["sender_id", 3], ["receiver_id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1 ORDER BY "messages"."id" DESC LIMIT $2  [["room_id", 2], ["LIMIT", 1]]
---
            <%# now we will check if a room exists between current_user and loop user. If exists fetch last messages from their chat and check if the last message was sent by the other user. If yes then show notification here. %>
            <% if user.rooms.find_by(sender_id: current_user.id, receiver_id: user.id) || user.rooms.find_by(sender_id: user.id, receiver_id: current_user.id) %>
              <% rooom = user.rooms.find_by(sender_id: current_user.id, receiver_id: user.id) || user.rooms.find_by(sender_id: user.id, receiver_id: current_user.id) %>
              <% if rooom.messages.last.status == false %>