app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1 ORDER BY "messages"."created_at" DESC  [["room_id", 5]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1 ORDER BY "messages"."id" DESC LIMIT $2  [["room_id", 2], ["LIMIT", 1]]
UPDATE "messages" SET "updated_at" = $1, "status" = $2 WHERE "messages"."id" = $3  [["updated_at", "2022-11-11 10:49:21.133433"], ["status", true], ["id", 22]]
---
  def new
    @messages = @room.messages.order(:created_at)
    @room.messages.last.update(status: true)

INSERT INTO "messages" ("body", "room_id", "user_id", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "helloo"], ["room_id", 2], ["user_id", 3], ["created_at", "2022-11-11 10:49:49.790769"], ["updated_at", "2022-11-11 10:49:49.790769"], ["status", false]]
---
  def create
    @message = current_user.messages.new(message_params)
    @message.save

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_room
    @room = Room.find(params[:room_id])