app/controllers/messages_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def new
    @room = Room.find(params[:room_id])