app/controllers/rooms_controller.rb

  def index
    # We will fetch all rooms along with messages to check in view for new message for every user
    @users = User.all_except(current_user).includes(:rooms, :messages) if current_user.present?
---
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1 ORDER BY "messages"."id" DESC LIMIT $2  [["room_id", 3], ["LIMIT", 1]]
SELECT "rooms".* FROM "rooms" WHERE ((sender_id = 2 and receiver_id = NULL) or (sender_id = NULL and receiver_id = 2))

  def create
    room = check_if_room_exist(params[:receiver_id])
    unless room.present?
      room = Room.create(sender: current_user, receiver_id: params[:receiver_id])
---
INSERT INTO "rooms" ("sender_id", "receiver_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sender_id", 3], ["receiver_id", 1], ["created_at", "2022-10-17 12:23:47.026222"], ["updated_at", "2022-10-17 12:23:47.026222"]]

  def check_if_room_exist(receiver_id)
    Room.where("(sender_id = ? and receiver_id = ?) or (sender_id = ? and receiver_id = ?)",
               current_user.id, receiver_id, receiver_id, current_user.id).first
---
SELECT "rooms".* FROM "rooms" WHERE ((sender_id = 3 and receiver_id = '1') or (sender_id = '1' and receiver_id = 3)) ORDER BY "rooms"."id" ASC LIMIT $1  [["LIMIT", 1]]